Technical2/app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index(): string
    {
        $model = new CustomerModel();
        $customers = $model->findAll();

INSERT INTO `customers` (`full_name`, `email`, `phone`, `created_at`) VALUES ('Jose Manalo', 'manalo@gmail.com', '0999999999', '2026-09-25 15:22:13')
---
        }

        $model = new CustomerModel();
        $model->insert([
            'full_name' => $data['fullName'],
            'email' => $data['email'],
            'phone' => $data['phone'] !== '' ? $data['phone'] : null,
            'created_at' => date('Y-m-d H:i:s'),
        ]);