Technical2/app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index(): string
    {
        $model = new UserModel();
        $users = $model->findAll();

SELECT *
FROM `users`
WHERE `username` = 'lomi_admin'
 LIMIT 1
---
        }

        $model = new UserModel();
        if ($model->where('username', $data['username'])->first() !== null) {

INSERT INTO `users` (`username`, `full_name`, `created_at`) VALUES ('lomi_admin', 'Lamuel Reyes', '2026-09-25 15:21:47')
---
                ->with('errors', ['username' => 'That username is already registered.']);
        }

        $model->insert([
            'username' => $data['username'],
            'full_name' => $data['fullName'],
            'created_at' => date('Y-m-d H:i:s'),
        ]);